Revit 2024 API
Element.IsPhaseDemolishedValid Method
 Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool IsPhaseDemolishedValid(
	ElementId demolishedPhaseId
)
Visual Basic
Public Function IsPhaseDemolishedValid ( _
	demolishedPhaseId As ElementId _
) As Boolean
Visual C++
public:
bool IsPhaseDemolishedValid(
	ElementId^ demolishedPhaseId
)
Parameters
demolishedPhaseId
Type: Autodesk.Revit.DB.ElementId
 The id of a Phase or invalidElementId.
Return Value
 True if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element, false otherwise.
Remarks
 Acts as a validator for setting the property DemolishedPhaseId.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace